//1
#include <iostream>

int main() {
    const int m = 4;
    const int n = 3;
    int arr[m][n] = {{1, 2, 3},
                     {4, 5, 6},
                     {7, 8, 9},
                     {10, 11, 12}};

    // Визначення кількості парних чисел у кожному рядку
    for (int i = 0; i < m; i++) {
        int count = 0; // Змінна для підрахунку кількості парних чисел
        for (int j = 0; j < n; j++) {
            if (arr[i][j] % 2 == 0) {
                count++;
            }
        }
        std::cout << "У рядку " << i+1 << " є " << count << " парних чисел." << std::endl;
    }

    return 0;
}

//2
#include <iostream>

int main() {
    const int m = 6;
    const int n = 4;
    int arr[m][n] = {{1, 2, 3, 4},
                     {5, 6, 7, 8},
                     {9, 10, 11, 12},
                     {13, 14, 15, 16},
                     {17, 18, 19, 20},
                     {21, 22, 23, 24}};

    // Визначення кількості парних чисел у кожному стовпчику
    for (int j = 0; j < n; j++) {
        int count = 0; // Змінна для підрахунку кількості парних чисел
        for (int i = 0; i < m; i++) {
            if (arr[i][j] % 2 == 0) {
                count++;
            }
        }
        std::cout << "У стовпчику " << j+1 << " є " << count << " парних чисел." << std::endl;
    }

    return 0;
}

//3
#include <iostream>

int main() {
    const int m = 5;
    const int n = 7;
    int arr[m][n] = {{1, 2, 3, 4, 5, 6, 7},
                     {8, 9, 10, 11, 12, 13, 14},
                     {15, 16, 17, 18, 19, 20, 21},
                     {22, 23, 24, 25, 26, 27, 28},
                     {29, 30, 31, 32, 33, 34, 35}};

    // Обчислення суми елементів кожного рядка
    for (int i = 0; i < m; i++) {
        int sum = 0; // Змінна для зберігання суми елементів рядка
        for (int j = 0; j < n; j++) {
            sum += arr[i][j];
        }
        std::cout << "Сума елементів у рядку " << i+1 << " дорівнює " << sum << std::endl;
    }

    return 0;
}